/**
 * @title javaPractice / exercise / Exercise03
 * @content メソッド分け, switch
 * @author shika
 * @date 2020-10-19
 */
/*
 * ◆Exercise03
 * x, yの値をユーザーに入力してもらい、
 * 更に計算方法を選んでもらう。[1]足し算, [2]引き算, [3]掛け算, [4]割り算
 *
 * 計算は mainメソッドとは別のメソッドで行い、
 * 計算結果の表示はmainメソッドで行うプログラムを作成せよ。
 */

import java.util.Scanner;

public class Exercise03 {

    public static void main(String[] args) {
        
    }//main()

}//class
/*
◇実行結果
xの値を入力してください。4
yの値を入力してください。2
計算方法を数字で選択してください。
[1]足し算, [2]引き算, [3]掛け算, [4]割り算1
計算結果は 6

xの値を入力してください。6
yの値を入力してください。2
計算方法を数字を入力してください。
[1]足し算, [2]引き算, [3]掛け算, [4]割り算2
計算結果は 4

xの値を入力してください。7
yの値を入力してください。0
計算方法を数字を入力してください。
[1]足し算, [2]引き算, [3]掛け算, [4]割り算4
0で割ることはできません。

xの値を入力してください。32
yの値を入力してください。24
計算方法を数字を入力してください。
[1]足し算, [2]引き算, [3]掛け算, [4]割り算 7
1～4の数字で入力してください。
*/